SkyRizzAI/kairo/firmware/targets/skyrizz-e32/sdkconfig.defaults
# SkyRizz E32 — sdkconfig defaults.
# ESP32-S3-WROOM-1-N16R8: 16 MB flash, 8 MB Octal PSRAM.
#
# GPIO conflict note:
#   GPIO43 (UART0 TXD default) → used as XL9535 INT#
#   GPIO44 (UART0 RXD default) → used as SCLK3 (microSD SPI clock)
# Therefore UART0 console is disabled; log output via USB CDC (GPIO19/20).

# Target
CONFIG_IDF_TARGET="esp32s3"

# Arduino-as-component: auto-run setup()/loop()
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_FREERTOS_HZ=1000

# 16 MB flash, QIO mode
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Octal PSRAM (N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y

# Bluetooth — NimBLE host (BLE-only; ESP32-S3 has no Classic BT). Plan 34.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Console + USB transport.
# GPIO43/44 (UART0) are taken by XL9535 INT + SPI clock, so UART console is out.
# Use the hardware USB-Serial-JTAG — the SAME interface the ROM bootloader and
# esptool use. This makes flashing auto-reset reliable and keeps the serial port
# stable across resets (no flaky "No serial data received").
# NOTE: ARDUINO_USB_MODE / ARDUINO_USB_CDC_ON_BOOT are Arduino-IDE build flags,
# NOT IDF Kconfig symbols — setting them here does nothing, so Arduino `Serial`
# stays mapped to UART0. Code must use HWCDCSerial explicitly for the USB port
# (see esp32_usb_cdc.cpp and main.cpp).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack size for Arduino task
CONFIG_ARDUINO_LOOP_STACK_SIZE=16384

# C++ features used by Kairo Core
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
